results/django-100-1k.1.log

Summary:
  Total:	2.1377 secs
  Slowest:	0.4998 secs
  Fastest:	0.0210 secs
  Average:	0.2382 secs
  Requests/sec:	467.7990
  
  Total data:	1532 bytes
  Size/request:	2 bytes

Response time histogram:
  0.021 [1]	|
  0.069 [26]	|■■■■■■
  0.117 [72]	|■■■■■■■■■■■■■■■■
  0.165 [90]	|■■■■■■■■■■■■■■■■■■■■
  0.213 [97]	|■■■■■■■■■■■■■■■■■■■■■■
  0.260 [178]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.308 [86]	|■■■■■■■■■■■■■■■■■■■
  0.356 [134]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.404 [56]	|■■■■■■■■■■■■■
  0.452 [18]	|■■■■
  0.500 [8]	|■■


Latency distribution:
  10% in 0.1084 secs
  25% in 0.1696 secs
  50% in 0.2375 secs
  75% in 0.3180 secs
  90% in 0.3580 secs
  95% in 0.3864 secs
  99% in 0.4660 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0094 secs, 0.0210 secs, 0.4998 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0017 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0320 secs, 0.0003 secs, 0.0856 secs
  resp read:	0.0009 secs, 0.0000 secs, 0.0186 secs

Status code distribution:
  [200]	766 responses

Error distribution:
  [36]	Get "http://localhost:8000/health": dial tcp [::1]:8000: connect: connection refused
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49217->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49411->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49412->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49428->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49563->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49564->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49567->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:49904->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:50215->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:50463->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:50573->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51433->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51459->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64662->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64664->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64667->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64668->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64669->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64671->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64673->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64674->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64680->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64681->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64683->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64684->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64686->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64687->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64688->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64691->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64693->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64696->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64699->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64701->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64705->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64707->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64711->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64712->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64718->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64721->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64722->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64726->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64730->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64758->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64759->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64760->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64762->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64764->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64765->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64766->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64767->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64768->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64769->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64771->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64772->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64773->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64774->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64775->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64776->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64777->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64778->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64779->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64780->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64781->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64782->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64783->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64784->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64786->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64787->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64788->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64791->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64792->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64793->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64794->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64795->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64796->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64797->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64798->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64799->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64800->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64801->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64802->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64803->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64804->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64805->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64806->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64807->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64808->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64810->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64812->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64814->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64819->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64842->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64844->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64847->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64850->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64857->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64858->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64859->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64866->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64879->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64895->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64897->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64908->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64922->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64923->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64927->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64928->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64930->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64936->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64937->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64938->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64939->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64941->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64944->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64945->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64946->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64947->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64948->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64950->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64953->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64956->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64957->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64959->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64960->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64961->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64963->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64965->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64968->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64970->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64972->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64975->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:64995->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65002->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65004->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65005->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65053->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65055->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65058->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65060->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65063->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65172->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65177->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65326->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65459->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:65463->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": readLoopPeekFailLocked: read tcp 127.0.0.1:64976->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": write tcp 127.0.0.1:49355->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://localhost:8000/health": write tcp 127.0.0.1:64974->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://localhost:8000/health": write tcp 127.0.0.1:65021->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://localhost:8000/health": write tcp 127.0.0.1:65022->127.0.0.1:8000: write: connection reset by peer
  [33]	Get "http://localhost:8000/health/": dial tcp [::1]:8000: connect: connection refused
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:49336->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:49418->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:49581->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:49721->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:49899->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:49922->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:50179->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:50180->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:50212->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:50213->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:50698->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:51432->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:65163->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:65179->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:65387->127.0.0.1:8000: read: connection reset by peer